Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/i2smcc.h
/* -------- I2SMCC_MRB : (I2SMCC Offset: 0x08) (R/W 32) Mode Register B -------- */
#define I2SMCC_MRB_CRAMODE_Pos                _U_(0)                                               /**< (I2SMCC_MRB) Common Register Access Mode Position */
#define I2SMCC_MRB_CRAMODE_Msk                (_U_(0x1) << I2SMCC_MRB_CRAMODE_Pos)                 /**< (I2SMCC_MRB) Common Register Access Mode Mask */
#define I2SMCC_MRB_CRAMODE(value)             (I2SMCC_MRB_CRAMODE_Msk & ((value) << I2SMCC_MRB_CRAMODE_Pos))
#define   I2SMCC_MRB_CRAMODE_LEFT_FIRST_Val   _U_(0x0)                                             /**< (I2SMCC_MRB) All enabled I2S left channels are filled first, then I2S right channels.  */
#define   I2SMCC_MRB_CRAMODE_REGULAR_Val      _U_(0x1)                                             /**< (I2SMCC_MRB) An enabled I2S left channel is filled, then the corresponding right channel, until all channels are filled.  */
#define I2SMCC_MRB_CRAMODE_LEFT_FIRST         (I2SMCC_MRB_CRAMODE_LEFT_FIRST_Val << I2SMCC_MRB_CRAMODE_Pos) /**< (I2SMCC_MRB) All enabled I2S left channels are filled first, then I2S right channels. Position  */
#define I2SMCC_MRB_CRAMODE_REGULAR            (I2SMCC_MRB_CRAMODE_REGULAR_Val << I2SMCC_MRB_CRAMODE_Pos) /**< (I2SMCC_MRB) An enabled I2S left channel is filled, then the corresponding right channel, until all channels are filled. Position  */
#define I2SMCC_MRB_DMACHUNK_Pos               _U_(8)                                               /**< (I2SMCC_MRB) DMA Chunk Size Position */
#define I2SMCC_MRB_DMACHUNK_Msk               (_U_(0x3) << I2SMCC_MRB_DMACHUNK_Pos)                /**< (I2SMCC_MRB) DMA Chunk Size Mask */
#define I2SMCC_MRB_DMACHUNK(value)            (I2SMCC_MRB_DMACHUNK_Msk & ((value) << I2SMCC_MRB_DMACHUNK_Pos))
#define   I2SMCC_MRB_DMACHUNK_1_WORD_Val      _U_(0x0)                                             /**< (I2SMCC_MRB) Each DMA transfer contains 1 word.  */
#define   I2SMCC_MRB_DMACHUNK_2_WORDS_Val     _U_(0x1)                                             /**< (I2SMCC_MRB) Each DMA transfer contains 2 words.  */
#define   I2SMCC_MRB_DMACHUNK_4_WORDS_Val     _U_(0x2)                                             /**< (I2SMCC_MRB) Each DMA transfer contains 4 words.  */
#define   I2SMCC_MRB_DMACHUNK_8_WORDS_Val     _U_(0x3)                                             /**< (I2SMCC_MRB) Each DMA transfer contains 8 words.  */
#define I2SMCC_MRB_DMACHUNK_1_WORD            (I2SMCC_MRB_DMACHUNK_1_WORD_Val << I2SMCC_MRB_DMACHUNK_Pos) /**< (I2SMCC_MRB) Each DMA transfer contains 1 word. Position  */
#define I2SMCC_MRB_DMACHUNK_2_WORDS           (I2SMCC_MRB_DMACHUNK_2_WORDS_Val << I2SMCC_MRB_DMACHUNK_Pos) /**< (I2SMCC_MRB) Each DMA transfer contains 2 words. Position  */
#define I2SMCC_MRB_DMACHUNK_4_WORDS           (I2SMCC_MRB_DMACHUNK_4_WORDS_Val << I2SMCC_MRB_DMACHUNK_Pos) /**< (I2SMCC_MRB) Each DMA transfer contains 4 words. Position  */
#define I2SMCC_MRB_DMACHUNK_8_WORDS           (I2SMCC_MRB_DMACHUNK_8_WORDS_Val << I2SMCC_MRB_DMACHUNK_Pos) /**< (I2SMCC_MRB) Each DMA transfer contains 8 words. Position  */
#define I2SMCC_MRB_CLKSEL_Pos                 _U_(16)                                              /**< (I2SMCC_MRB) Serial Clock Selection Position */
#define I2SMCC_MRB_CLKSEL_Msk                 (_U_(0x1) << I2SMCC_MRB_CLKSEL_Pos)                  /**< (I2SMCC_MRB) Serial Clock Selection Mask */
#define I2SMCC_MRB_CLKSEL(value)              (I2SMCC_MRB_CLKSEL_Msk & ((value) << I2SMCC_MRB_CLKSEL_Pos))
#define I2SMCC_MRB_Msk                        _U_(0x00010301)                                      /**< (I2SMCC_MRB) Register Mask  */


/* -------- I2SMCC_SR : (I2SMCC Offset: 0x0C) ( R/ 32) Status Register -------- */
#define I2SMCC_SR_RXEN_Pos                    _U_(0)                                               /**< (I2SMCC_SR) Receiver Enabled Position */
#define I2SMCC_SR_RXEN_Msk                    (_U_(0x1) << I2SMCC_SR_RXEN_Pos)                     /**< (I2SMCC_SR) Receiver Enabled Mask */
#define I2SMCC_SR_RXEN(value)                 (I2SMCC_SR_RXEN_Msk & ((value) << I2SMCC_SR_RXEN_Pos))
#define I2SMCC_SR_TXEN_Pos                    _U_(4)                                               /**< (I2SMCC_SR) Transmitter Enabled Position */
#define I2SMCC_SR_TXEN_Msk                    (_U_(0x1) << I2SMCC_SR_TXEN_Pos)                     /**< (I2SMCC_SR) Transmitter Enabled Mask */
#define I2SMCC_SR_TXEN(value)                 (I2SMCC_SR_TXEN_Msk & ((value) << I2SMCC_SR_TXEN_Pos))
#define I2SMCC_SR_Msk                         _U_(0x00000011)                                      /**< (I2SMCC_SR) Register Mask  */


/* -------- I2SMCC_IERA : (I2SMCC Offset: 0x10) ( /W 32) Interrupt Enable Register A -------- */
#define I2SMCC_IERA_TXLRDY0_Pos               _U_(0)                                               /**< (I2SMCC_IERA) I2S Transmit Left 0 (x=0 only) or TDM Channel 2x Ready Interrupt Enable Position */
#define I2SMCC_IERA_TXLRDY0_Msk               (_U_(0x1) << I2SMCC_IERA_TXLRDY0_Pos)                /**< (I2SMCC_IERA) I2S Transmit Left 0 (x=0 only) or TDM Channel 2x Ready Interrupt Enable Mask */
#define I2SMCC_IERA_TXLRDY0(value)            (I2SMCC_IERA_TXLRDY0_Msk & ((value) << I2SMCC_IERA_TXLRDY0_Pos))
#define I2SMCC_IERA_TXRRDY0_Pos               _U_(1)                                               /**< (I2SMCC_IERA) I2S Transmit Right 0 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Enable Position */
#define I2SMCC_IERA_TXRRDY0_Msk               (_U_(0x1) << I2SMCC_IERA_TXRRDY0_Pos)                /**< (I2SMCC_IERA) I2S Transmit Right 0 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Enable Mask */
#define I2SMCC_IERA_TXRRDY0(value)            (I2SMCC_IERA_TXRRDY0_Msk & ((value) << I2SMCC_IERA_TXRRDY0_Pos))
#define I2SMCC_IERA_TXLRDY1_Pos               _U_(2)                                               /**< (I2SMCC_IERA) I2S Transmit Left 1 (x=0 only) or TDM Channel 2x Ready Interrupt Enable Position */
#define I2SMCC_IERA_TXLRDY1_Msk               (_U_(0x1) << I2SMCC_IERA_TXLRDY1_Pos)                /**< (I2SMCC_IERA) I2S Transmit Left 1 (x=0 only) or TDM Channel 2x Ready Interrupt Enable Mask */
#define I2SMCC_IERA_TXLRDY1(value)            (I2SMCC_IERA_TXLRDY1_Msk & ((value) << I2SMCC_IERA_TXLRDY1_Pos))
#define I2SMCC_IERA_TXRRDY1_Pos               _U_(3)                                               /**< (I2SMCC_IERA) I2S Transmit Right 1 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Enable Position */
#define I2SMCC_IERA_TXRRDY1_Msk               (_U_(0x1) << I2SMCC_IERA_TXRRDY1_Pos)                /**< (I2SMCC_IERA) I2S Transmit Right 1 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Enable Mask */
#define I2SMCC_IERA_TXRRDY1(value)            (I2SMCC_IERA_TXRRDY1_Msk & ((value) << I2SMCC_IERA_TXRRDY1_Pos))
#define I2SMCC_IERA_TXLRDY2_Pos               _U_(4)                                               /**< (I2SMCC_IERA) I2S Transmit Left 2 (x=0 only) or TDM Channel 2x Ready Interrupt Enable Position */
#define I2SMCC_IERA_TXLRDY2_Msk               (_U_(0x1) << I2SMCC_IERA_TXLRDY2_Pos)                /**< (I2SMCC_IERA) I2S Transmit Left 2 (x=0 only) or TDM Channel 2x Ready Interrupt Enable Mask */
#define I2SMCC_IERA_TXLRDY2(value)            (I2SMCC_IERA_TXLRDY2_Msk & ((value) << I2SMCC_IERA_TXLRDY2_Pos))
#define I2SMCC_IERA_TXRRDY2_Pos               _U_(5)                                               /**< (I2SMCC_IERA) I2S Transmit Right 2 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Enable Position */
#define I2SMCC_IERA_TXRRDY2_Msk               (_U_(0x1) << I2SMCC_IERA_TXRRDY2_Pos)                /**< (I2SMCC_IERA) I2S Transmit Right 2 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Enable Mask */
#define I2SMCC_IERA_TXRRDY2(value)            (I2SMCC_IERA_TXRRDY2_Msk & ((value) << I2SMCC_IERA_TXRRDY2_Pos))
#define I2SMCC_IERA_TXLRDY3_Pos               _U_(6)                                               /**< (I2SMCC_IERA) I2S Transmit Left 3 (x=0 only) or TDM Channel 2x Ready Interrupt Enable Position */
#define I2SMCC_IERA_TXLRDY3_Msk               (_U_(0x1) << I2SMCC_IERA_TXLRDY3_Pos)                /**< (I2SMCC_IERA) I2S Transmit Left 3 (x=0 only) or TDM Channel 2x Ready Interrupt Enable Mask */
#define I2SMCC_IERA_TXLRDY3(value)            (I2SMCC_IERA_TXLRDY3_Msk & ((value) << I2SMCC_IERA_TXLRDY3_Pos))
#define I2SMCC_IERA_TXRRDY3_Pos               _U_(7)                                               /**< (I2SMCC_IERA) I2S Transmit Right 3 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Enable Position */
#define I2SMCC_IERA_TXRRDY3_Msk               (_U_(0x1) << I2SMCC_IERA_TXRRDY3_Pos)                /**< (I2SMCC_IERA) I2S Transmit Right 3 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Enable Mask */
#define I2SMCC_IERA_TXRRDY3(value)            (I2SMCC_IERA_TXRRDY3_Msk & ((value) << I2SMCC_IERA_TXRRDY3_Pos))
#define I2SMCC_IERA_TXLUNF0_Pos               _U_(8)                                               /**< (I2SMCC_IERA) I2S Transmit Left 0 (x=0 only) or TDM Channel 2x Underrun Interrupt Enable Position */
#define I2SMCC_IERA_TXLUNF0_Msk               (_U_(0x1) << I2SMCC_IERA_TXLUNF0_Pos)                /**< (I2SMCC_IERA) I2S Transmit Left 0 (x=0 only) or TDM Channel 2x Underrun Interrupt Enable Mask */
#define I2SMCC_IERA_TXLUNF0(value)            (I2SMCC_IERA_TXLUNF0_Msk & ((value) << I2SMCC_IERA_TXLUNF0_Pos))
#define I2SMCC_IERA_TXRUNF0_Pos               _U_(9)                                               /**< (I2SMCC_IERA) I2S Transmit Right 0 (x=0 only) or TDM Channel [2x]+1 Underrun Interrupt Enable Position */
#define I2SMCC_IERA_TXRUNF0_Msk               (_U_(0x1) << I2SMCC_IERA_TXRUNF0_Pos)                /**< (I2SMCC_IERA) I2S Transmit Right 0 (x=0 only) or TDM Channel [2x]+1 Underrun Interrupt Enable Mask */
#define I2SMCC_IERA_TXRUNF0(value)            (I2SMCC_IERA_TXRUNF0_Msk & ((value) << I2SMCC_IERA_TXRUNF0_Pos))
#define I2SMCC_IERA_TXLUNF1_Pos               _U_(10)                                              /**< (I2SMCC_IERA) I2S Transmit Left 1 (x=0 only) or TDM Channel 2x Underrun Interrupt Enable Position */
#define I2SMCC_IERA_TXLUNF1_Msk               (_U_(0x1) << I2SMCC_IERA_TXLUNF1_Pos)                /**< (I2SMCC_IERA) I2S Transmit Left 1 (x=0 only) or TDM Channel 2x Underrun Interrupt Enable Mask */
#define I2SMCC_IERA_TXLUNF1(value)            (I2SMCC_IERA_TXLUNF1_Msk & ((value) << I2SMCC_IERA_TXLUNF1_Pos))
#define I2SMCC_IERA_TXRUNF1_Pos               _U_(11)                                              /**< (I2SMCC_IERA) I2S Transmit Right 1 (x=0 only) or TDM Channel [2x]+1 Underrun Interrupt Enable Position */
#define I2SMCC_IERA_TXRUNF1_Msk               (_U_(0x1) << I2SMCC_IERA_TXRUNF1_Pos)                /**< (I2SMCC_IERA) I2S Transmit Right 1 (x=0 only) or TDM Channel [2x]+1 Underrun Interrupt Enable Mask */
#define I2SMCC_IERA_TXRUNF1(value)            (I2SMCC_IERA_TXRUNF1_Msk & ((value) << I2SMCC_IERA_TXRUNF1_Pos))
#define I2SMCC_IERA_TXLUNF2_Pos               _U_(12)                                              /**< (I2SMCC_IERA) I2S Transmit Left 2 (x=0 only) or TDM Channel 2x Underrun Interrupt Enable Position */
#define I2SMCC_IERA_TXLUNF2_Msk               (_U_(0x1) << I2SMCC_IERA_TXLUNF2_Pos)                /**< (I2SMCC_IERA) I2S Transmit Left 2 (x=0 only) or TDM Channel 2x Underrun Interrupt Enable Mask */
#define I2SMCC_IERA_TXLUNF2(value)            (I2SMCC_IERA_TXLUNF2_Msk & ((value) << I2SMCC_IERA_TXLUNF2_Pos))
#define I2SMCC_IERA_TXRUNF2_Pos               _U_(13)                                              /**< (I2SMCC_IERA) I2S Transmit Right 2 (x=0 only) or TDM Channel [2x]+1 Underrun Interrupt Enable Position */
#define I2SMCC_IERA_TXRUNF2_Msk               (_U_(0x1) << I2SMCC_IERA_TXRUNF2_Pos)                /**< (I2SMCC_IERA) I2S Transmit Right 2 (x=0 only) or TDM Channel [2x]+1 Underrun Interrupt Enable Mask */
#define I2SMCC_IERA_TXRUNF2(value)            (I2SMCC_IERA_TXRUNF2_Msk & ((value) << I2SMCC_IERA_TXRUNF2_Pos))
#define I2SMCC_IERA_TXLUNF3_Pos               _U_(14)                                              /**< (I2SMCC_IERA) I2S Transmit Left 3 (x=0 only) or TDM Channel 2x Underrun Interrupt Enable Position */
#define I2SMCC_IERA_TXLUNF3_Msk               (_U_(0x1) << I2SMCC_IERA_TXLUNF3_Pos)                /**< (I2SMCC_IERA) I2S Transmit Left 3 (x=0 only) or TDM Channel 2x Underrun Interrupt Enable Mask */
#define I2SMCC_IERA_TXLUNF3(value)            (I2SMCC_IERA_TXLUNF3_Msk & ((value) << I2SMCC_IERA_TXLUNF3_Pos))
#define I2SMCC_IERA_TXRUNF3_Pos               _U_(15)                                              /**< (I2SMCC_IERA) I2S Transmit Right 3 (x=0 only) or TDM Channel [2x]+1 Underrun Interrupt Enable Position */
#define I2SMCC_IERA_TXRUNF3_Msk               (_U_(0x1) << I2SMCC_IERA_TXRUNF3_Pos)                /**< (I2SMCC_IERA) I2S Transmit Right 3 (x=0 only) or TDM Channel [2x]+1 Underrun Interrupt Enable Mask */
#define I2SMCC_IERA_TXRUNF3(value)            (I2SMCC_IERA_TXRUNF3_Msk & ((value) << I2SMCC_IERA_TXRUNF3_Pos))
#define I2SMCC_IERA_RXLRDY0_Pos               _U_(16)                                              /**< (I2SMCC_IERA) I2S Receive Left 0 (x=0 only) or TDM Channel 2x Ready Interrupt Enable Position */
#define I2SMCC_IERA_RXLRDY0_Msk               (_U_(0x1) << I2SMCC_IERA_RXLRDY0_Pos)                /**< (I2SMCC_IERA) I2S Receive Left 0 (x=0 only) or TDM Channel 2x Ready Interrupt Enable Mask */
#define I2SMCC_IERA_RXLRDY0(value)            (I2SMCC_IERA_RXLRDY0_Msk & ((value) << I2SMCC_IERA_RXLRDY0_Pos))
#define I2SMCC_IERA_RXRRDY0_Pos               _U_(17)                                              /**< (I2SMCC_IERA) I2S Receive Right 0 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Enable Position */
#define I2SMCC_IERA_RXRRDY0_Msk               (_U_(0x1) << I2SMCC_IERA_RXRRDY0_Pos)                /**< (I2SMCC_IERA) I2S Receive Right 0 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Enable Mask */
#define I2SMCC_IERA_RXRRDY0(value)            (I2SMCC_IERA_RXRRDY0_Msk & ((value) << I2SMCC_IERA_RXRRDY0_Pos))
#define I2SMCC_IERA_RXLRDY1_Pos               _U_(18)                                              /**< (I2SMCC_IERA) I2S Receive Left 1 (x=0 only) or TDM Channel 2x Ready Interrupt Enable Position */
#define I2SMCC_IERA_RXLRDY1_Msk               (_U_(0x1) << I2SMCC_IERA_RXLRDY1_Pos)                /**< (I2SMCC_IERA) I2S Receive Left 1 (x=0 only) or TDM Channel 2x Ready Interrupt Enable Mask */
#define I2SMCC_IERA_RXLRDY1(value)            (I2SMCC_IERA_RXLRDY1_Msk & ((value) << I2SMCC_IERA_RXLRDY1_Pos))
#define I2SMCC_IERA_RXRRDY1_Pos               _U_(19)                                              /**< (I2SMCC_IERA) I2S Receive Right 1 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Enable Position */
#define I2SMCC_IERA_RXRRDY1_Msk               (_U_(0x1) << I2SMCC_IERA_RXRRDY1_Pos)                /**< (I2SMCC_IERA) I2S Receive Right 1 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Enable Mask */
#define I2SMCC_IERA_RXRRDY1(value)            (I2SMCC_IERA_RXRRDY1_Msk & ((value) << I2SMCC_IERA_RXRRDY1_Pos))
#define I2SMCC_IERA_RXLRDY2_Pos               _U_(20)                                              /**< (I2SMCC_IERA) I2S Receive Left 2 (x=0 only) or TDM Channel 2x Ready Interrupt Enable Position */
#define I2SMCC_IERA_RXLRDY2_Msk               (_U_(0x1) << I2SMCC_IERA_RXLRDY2_Pos)                /**< (I2SMCC_IERA) I2S Receive Left 2 (x=0 only) or TDM Channel 2x Ready Interrupt Enable Mask */
#define I2SMCC_IERA_RXLRDY2(value)            (I2SMCC_IERA_RXLRDY2_Msk & ((value) << I2SMCC_IERA_RXLRDY2_Pos))
#define I2SMCC_IERA_RXRRDY2_Pos               _U_(21)                                              /**< (I2SMCC_IERA) I2S Receive Right 2 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Enable Position */
#define I2SMCC_IERA_RXRRDY2_Msk               (_U_(0x1) << I2SMCC_IERA_RXRRDY2_Pos)                /**< (I2SMCC_IERA) I2S Receive Right 2 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Enable Mask */
#define I2SMCC_IERA_RXRRDY2(value)            (I2SMCC_IERA_RXRRDY2_Msk & ((value) << I2SMCC_IERA_RXRRDY2_Pos))
#define I2SMCC_IERA_RXLRDY3_Pos               _U_(22)                                              /**< (I2SMCC_IERA) I2S Receive Left 3 (x=0 only) or TDM Channel 2x Ready Interrupt Enable Position */
#define I2SMCC_IERA_RXLRDY3_Msk               (_U_(0x1) << I2SMCC_IERA_RXLRDY3_Pos)                /**< (I2SMCC_IERA) I2S Receive Left 3 (x=0 only) or TDM Channel 2x Ready Interrupt Enable Mask */
#define I2SMCC_IERA_RXLRDY3(value)            (I2SMCC_IERA_RXLRDY3_Msk & ((value) << I2SMCC_IERA_RXLRDY3_Pos))
#define I2SMCC_IERA_RXRRDY3_Pos               _U_(23)                                              /**< (I2SMCC_IERA) I2S Receive Right 3 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Enable Position */
#define I2SMCC_IERA_RXRRDY3_Msk               (_U_(0x1) << I2SMCC_IERA_RXRRDY3_Pos)                /**< (I2SMCC_IERA) I2S Receive Right 3 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Enable Mask */
#define I2SMCC_IERA_RXRRDY3(value)            (I2SMCC_IERA_RXRRDY3_Msk & ((value) << I2SMCC_IERA_RXRRDY3_Pos))
#define I2SMCC_IERA_RXLOVF0_Pos               _U_(24)                                              /**< (I2SMCC_IERA) I2S Receive Left 0 (x=0 only) or TDM Channel 2x Overrun Interrupt Enable Position */
#define I2SMCC_IERA_RXLOVF0_Msk               (_U_(0x1) << I2SMCC_IERA_RXLOVF0_Pos)                /**< (I2SMCC_IERA) I2S Receive Left 0 (x=0 only) or TDM Channel 2x Overrun Interrupt Enable Mask */
#define I2SMCC_IERA_RXLOVF0(value)            (I2SMCC_IERA_RXLOVF0_Msk & ((value) << I2SMCC_IERA_RXLOVF0_Pos))
#define I2SMCC_IERA_RXROVF0_Pos               _U_(25)                                              /**< (I2SMCC_IERA) I2S Receive Right 0 (x=0 only) or TDM Channel [2x]+1 Overrun Interrupt Enable Position */
#define I2SMCC_IERA_RXROVF0_Msk               (_U_(0x1) << I2SMCC_IERA_RXROVF0_Pos)                /**< (I2SMCC_IERA) I2S Receive Right 0 (x=0 only) or TDM Channel [2x]+1 Overrun Interrupt Enable Mask */
#define I2SMCC_IERA_RXROVF0(value)            (I2SMCC_IERA_RXROVF0_Msk & ((value) << I2SMCC_IERA_RXROVF0_Pos))
#define I2SMCC_IERA_RXLOVF1_Pos               _U_(26)                                              /**< (I2SMCC_IERA) I2S Receive Left 1 (x=0 only) or TDM Channel 2x Overrun Interrupt Enable Position */
#define I2SMCC_IERA_RXLOVF1_Msk               (_U_(0x1) << I2SMCC_IERA_RXLOVF1_Pos)                /**< (I2SMCC_IERA) I2S Receive Left 1 (x=0 only) or TDM Channel 2x Overrun Interrupt Enable Mask */
#define I2SMCC_IERA_RXLOVF1(value)            (I2SMCC_IERA_RXLOVF1_Msk & ((value) << I2SMCC_IERA_RXLOVF1_Pos))
#define I2SMCC_IERA_RXROVF1_Pos               _U_(27)                                              /**< (I2SMCC_IERA) I2S Receive Right 1 (x=0 only) or TDM Channel [2x]+1 Overrun Interrupt Enable Position */
#define I2SMCC_IERA_RXROVF1_Msk               (_U_(0x1) << I2SMCC_IERA_RXROVF1_Pos)                /**< (I2SMCC_IERA) I2S Receive Right 1 (x=0 only) or TDM Channel [2x]+1 Overrun Interrupt Enable Mask */
#define I2SMCC_IERA_RXROVF1(value)            (I2SMCC_IERA_RXROVF1_Msk & ((value) << I2SMCC_IERA_RXROVF1_Pos))
#define I2SMCC_IERA_RXLOVF2_Pos               _U_(28)                                              /**< (I2SMCC_IERA) I2S Receive Left 2 (x=0 only) or TDM Channel 2x Overrun Interrupt Enable Position */
#define I2SMCC_IERA_RXLOVF2_Msk               (_U_(0x1) << I2SMCC_IERA_RXLOVF2_Pos)                /**< (I2SMCC_IERA) I2S Receive Left 2 (x=0 only) or TDM Channel 2x Overrun Interrupt Enable Mask */
#define I2SMCC_IERA_RXLOVF2(value)            (I2SMCC_IERA_RXLOVF2_Msk & ((value) << I2SMCC_IERA_RXLOVF2_Pos))
#define I2SMCC_IERA_RXROVF2_Pos               _U_(29)                                              /**< (I2SMCC_IERA) I2S Receive Right 2 (x=0 only) or TDM Channel [2x]+1 Overrun Interrupt Enable Position */
#define I2SMCC_IERA_RXROVF2_Msk               (_U_(0x1) << I2SMCC_IERA_RXROVF2_Pos)                /**< (I2SMCC_IERA) I2S Receive Right 2 (x=0 only) or TDM Channel [2x]+1 Overrun Interrupt Enable Mask */
#define I2SMCC_IERA_RXROVF2(value)            (I2SMCC_IERA_RXROVF2_Msk & ((value) << I2SMCC_IERA_RXROVF2_Pos))
#define I2SMCC_IERA_RXLOVF3_Pos               _U_(30)                                              /**< (I2SMCC_IERA) I2S Receive Left 3 (x=0 only) or TDM Channel 2x Overrun Interrupt Enable Position */
#define I2SMCC_IERA_RXLOVF3_Msk               (_U_(0x1) << I2SMCC_IERA_RXLOVF3_Pos)                /**< (I2SMCC_IERA) I2S Receive Left 3 (x=0 only) or TDM Channel 2x Overrun Interrupt Enable Mask */
#define I2SMCC_IERA_RXLOVF3(value)            (I2SMCC_IERA_RXLOVF3_Msk & ((value) << I2SMCC_IERA_RXLOVF3_Pos))
#define I2SMCC_IERA_RXROVF3_Pos               _U_(31)                                              /**< (I2SMCC_IERA) I2S Receive Right 3 (x=0 only) or TDM Channel [2x]+1 Overrun Interrupt Enable Position */
#define I2SMCC_IERA_RXROVF3_Msk               (_U_(0x1) << I2SMCC_IERA_RXROVF3_Pos)                /**< (I2SMCC_IERA) I2S Receive Right 3 (x=0 only) or TDM Channel [2x]+1 Overrun Interrupt Enable Mask */
#define I2SMCC_IERA_RXROVF3(value)            (I2SMCC_IERA_RXROVF3_Msk & ((value) << I2SMCC_IERA_RXROVF3_Pos))
#define I2SMCC_IERA_Msk                       _U_(0xFFFFFFFF)                                      /**< (I2SMCC_IERA) Register Mask  */


