Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/i2smcc.h
/* -------- I2SMCC_IDRA : (I2SMCC Offset: 0x14) ( /W 32) Interrupt Disable Register A -------- */
#define I2SMCC_IDRA_TXLRDY0_Pos               _U_(0)                                               /**< (I2SMCC_IDRA) I2S Transmit Left 0 (x=0 only) or TDM Channel 2x Ready Interrupt Disable Position */
#define I2SMCC_IDRA_TXLRDY0_Msk               (_U_(0x1) << I2SMCC_IDRA_TXLRDY0_Pos)                /**< (I2SMCC_IDRA) I2S Transmit Left 0 (x=0 only) or TDM Channel 2x Ready Interrupt Disable Mask */
#define I2SMCC_IDRA_TXLRDY0(value)            (I2SMCC_IDRA_TXLRDY0_Msk & ((value) << I2SMCC_IDRA_TXLRDY0_Pos))
#define I2SMCC_IDRA_TXRRDY0_Pos               _U_(1)                                               /**< (I2SMCC_IDRA) I2S Transmit Right 0 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Disable Position */
#define I2SMCC_IDRA_TXRRDY0_Msk               (_U_(0x1) << I2SMCC_IDRA_TXRRDY0_Pos)                /**< (I2SMCC_IDRA) I2S Transmit Right 0 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Disable Mask */
#define I2SMCC_IDRA_TXRRDY0(value)            (I2SMCC_IDRA_TXRRDY0_Msk & ((value) << I2SMCC_IDRA_TXRRDY0_Pos))
#define I2SMCC_IDRA_TXLRDY1_Pos               _U_(2)                                               /**< (I2SMCC_IDRA) I2S Transmit Left 1 (x=0 only) or TDM Channel 2x Ready Interrupt Disable Position */
#define I2SMCC_IDRA_TXLRDY1_Msk               (_U_(0x1) << I2SMCC_IDRA_TXLRDY1_Pos)                /**< (I2SMCC_IDRA) I2S Transmit Left 1 (x=0 only) or TDM Channel 2x Ready Interrupt Disable Mask */
#define I2SMCC_IDRA_TXLRDY1(value)            (I2SMCC_IDRA_TXLRDY1_Msk & ((value) << I2SMCC_IDRA_TXLRDY1_Pos))
#define I2SMCC_IDRA_TXRRDY1_Pos               _U_(3)                                               /**< (I2SMCC_IDRA) I2S Transmit Right 1 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Disable Position */
#define I2SMCC_IDRA_TXRRDY1_Msk               (_U_(0x1) << I2SMCC_IDRA_TXRRDY1_Pos)                /**< (I2SMCC_IDRA) I2S Transmit Right 1 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Disable Mask */
#define I2SMCC_IDRA_TXRRDY1(value)            (I2SMCC_IDRA_TXRRDY1_Msk & ((value) << I2SMCC_IDRA_TXRRDY1_Pos))
#define I2SMCC_IDRA_TXLRDY2_Pos               _U_(4)                                               /**< (I2SMCC_IDRA) I2S Transmit Left 2 (x=0 only) or TDM Channel 2x Ready Interrupt Disable Position */
#define I2SMCC_IDRA_TXLRDY2_Msk               (_U_(0x1) << I2SMCC_IDRA_TXLRDY2_Pos)                /**< (I2SMCC_IDRA) I2S Transmit Left 2 (x=0 only) or TDM Channel 2x Ready Interrupt Disable Mask */
#define I2SMCC_IDRA_TXLRDY2(value)            (I2SMCC_IDRA_TXLRDY2_Msk & ((value) << I2SMCC_IDRA_TXLRDY2_Pos))
#define I2SMCC_IDRA_TXRRDY2_Pos               _U_(5)                                               /**< (I2SMCC_IDRA) I2S Transmit Right 2 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Disable Position */
#define I2SMCC_IDRA_TXRRDY2_Msk               (_U_(0x1) << I2SMCC_IDRA_TXRRDY2_Pos)                /**< (I2SMCC_IDRA) I2S Transmit Right 2 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Disable Mask */
#define I2SMCC_IDRA_TXRRDY2(value)            (I2SMCC_IDRA_TXRRDY2_Msk & ((value) << I2SMCC_IDRA_TXRRDY2_Pos))
#define I2SMCC_IDRA_TXLRDY3_Pos               _U_(6)                                               /**< (I2SMCC_IDRA) I2S Transmit Left 3 (x=0 only) or TDM Channel 2x Ready Interrupt Disable Position */
#define I2SMCC_IDRA_TXLRDY3_Msk               (_U_(0x1) << I2SMCC_IDRA_TXLRDY3_Pos)                /**< (I2SMCC_IDRA) I2S Transmit Left 3 (x=0 only) or TDM Channel 2x Ready Interrupt Disable Mask */
#define I2SMCC_IDRA_TXLRDY3(value)            (I2SMCC_IDRA_TXLRDY3_Msk & ((value) << I2SMCC_IDRA_TXLRDY3_Pos))
#define I2SMCC_IDRA_TXRRDY3_Pos               _U_(7)                                               /**< (I2SMCC_IDRA) I2S Transmit Right 3 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Disable Position */
#define I2SMCC_IDRA_TXRRDY3_Msk               (_U_(0x1) << I2SMCC_IDRA_TXRRDY3_Pos)                /**< (I2SMCC_IDRA) I2S Transmit Right 3 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Disable Mask */
#define I2SMCC_IDRA_TXRRDY3(value)            (I2SMCC_IDRA_TXRRDY3_Msk & ((value) << I2SMCC_IDRA_TXRRDY3_Pos))
#define I2SMCC_IDRA_TXLUNF0_Pos               _U_(8)                                               /**< (I2SMCC_IDRA) I2S Transmit Left 0 (x=0 only) or TDM Channel 2x Underrun Interrupt Disable Position */
#define I2SMCC_IDRA_TXLUNF0_Msk               (_U_(0x1) << I2SMCC_IDRA_TXLUNF0_Pos)                /**< (I2SMCC_IDRA) I2S Transmit Left 0 (x=0 only) or TDM Channel 2x Underrun Interrupt Disable Mask */
#define I2SMCC_IDRA_TXLUNF0(value)            (I2SMCC_IDRA_TXLUNF0_Msk & ((value) << I2SMCC_IDRA_TXLUNF0_Pos))
#define I2SMCC_IDRA_TXRUNF0_Pos               _U_(9)                                               /**< (I2SMCC_IDRA) I2S Transmit Right 0 (x=0 only) or TDM Channel [2x]+1 Underrun Interrupt Disable Position */
#define I2SMCC_IDRA_TXRUNF0_Msk               (_U_(0x1) << I2SMCC_IDRA_TXRUNF0_Pos)                /**< (I2SMCC_IDRA) I2S Transmit Right 0 (x=0 only) or TDM Channel [2x]+1 Underrun Interrupt Disable Mask */
#define I2SMCC_IDRA_TXRUNF0(value)            (I2SMCC_IDRA_TXRUNF0_Msk & ((value) << I2SMCC_IDRA_TXRUNF0_Pos))
#define I2SMCC_IDRA_TXLUNF1_Pos               _U_(10)                                              /**< (I2SMCC_IDRA) I2S Transmit Left 1 (x=0 only) or TDM Channel 2x Underrun Interrupt Disable Position */
#define I2SMCC_IDRA_TXLUNF1_Msk               (_U_(0x1) << I2SMCC_IDRA_TXLUNF1_Pos)                /**< (I2SMCC_IDRA) I2S Transmit Left 1 (x=0 only) or TDM Channel 2x Underrun Interrupt Disable Mask */
#define I2SMCC_IDRA_TXLUNF1(value)            (I2SMCC_IDRA_TXLUNF1_Msk & ((value) << I2SMCC_IDRA_TXLUNF1_Pos))
#define I2SMCC_IDRA_TXRUNF1_Pos               _U_(11)                                              /**< (I2SMCC_IDRA) I2S Transmit Right 1 (x=0 only) or TDM Channel [2x]+1 Underrun Interrupt Disable Position */
#define I2SMCC_IDRA_TXRUNF1_Msk               (_U_(0x1) << I2SMCC_IDRA_TXRUNF1_Pos)                /**< (I2SMCC_IDRA) I2S Transmit Right 1 (x=0 only) or TDM Channel [2x]+1 Underrun Interrupt Disable Mask */
#define I2SMCC_IDRA_TXRUNF1(value)            (I2SMCC_IDRA_TXRUNF1_Msk & ((value) << I2SMCC_IDRA_TXRUNF1_Pos))
#define I2SMCC_IDRA_TXLUNF2_Pos               _U_(12)                                              /**< (I2SMCC_IDRA) I2S Transmit Left 2 (x=0 only) or TDM Channel 2x Underrun Interrupt Disable Position */
#define I2SMCC_IDRA_TXLUNF2_Msk               (_U_(0x1) << I2SMCC_IDRA_TXLUNF2_Pos)                /**< (I2SMCC_IDRA) I2S Transmit Left 2 (x=0 only) or TDM Channel 2x Underrun Interrupt Disable Mask */
#define I2SMCC_IDRA_TXLUNF2(value)            (I2SMCC_IDRA_TXLUNF2_Msk & ((value) << I2SMCC_IDRA_TXLUNF2_Pos))
#define I2SMCC_IDRA_TXRUNF2_Pos               _U_(13)                                              /**< (I2SMCC_IDRA) I2S Transmit Right 2 (x=0 only) or TDM Channel [2x]+1 Underrun Interrupt Disable Position */
#define I2SMCC_IDRA_TXRUNF2_Msk               (_U_(0x1) << I2SMCC_IDRA_TXRUNF2_Pos)                /**< (I2SMCC_IDRA) I2S Transmit Right 2 (x=0 only) or TDM Channel [2x]+1 Underrun Interrupt Disable Mask */
#define I2SMCC_IDRA_TXRUNF2(value)            (I2SMCC_IDRA_TXRUNF2_Msk & ((value) << I2SMCC_IDRA_TXRUNF2_Pos))
#define I2SMCC_IDRA_TXLUNF3_Pos               _U_(14)                                              /**< (I2SMCC_IDRA) I2S Transmit Left 3 (x=0 only) or TDM Channel 2x Underrun Interrupt Disable Position */
#define I2SMCC_IDRA_TXLUNF3_Msk               (_U_(0x1) << I2SMCC_IDRA_TXLUNF3_Pos)                /**< (I2SMCC_IDRA) I2S Transmit Left 3 (x=0 only) or TDM Channel 2x Underrun Interrupt Disable Mask */
#define I2SMCC_IDRA_TXLUNF3(value)            (I2SMCC_IDRA_TXLUNF3_Msk & ((value) << I2SMCC_IDRA_TXLUNF3_Pos))
#define I2SMCC_IDRA_TXRUNF3_Pos               _U_(15)                                              /**< (I2SMCC_IDRA) I2S Transmit Right 3 (x=0 only) or TDM Channel [2x]+1 Underrun Interrupt Disable Position */
#define I2SMCC_IDRA_TXRUNF3_Msk               (_U_(0x1) << I2SMCC_IDRA_TXRUNF3_Pos)                /**< (I2SMCC_IDRA) I2S Transmit Right 3 (x=0 only) or TDM Channel [2x]+1 Underrun Interrupt Disable Mask */
#define I2SMCC_IDRA_TXRUNF3(value)            (I2SMCC_IDRA_TXRUNF3_Msk & ((value) << I2SMCC_IDRA_TXRUNF3_Pos))
#define I2SMCC_IDRA_RXLRDY0_Pos               _U_(16)                                              /**< (I2SMCC_IDRA) I2S Receive Left 0 (x=0 only) or TDM Channel 2x Ready Interrupt Disable Position */
#define I2SMCC_IDRA_RXLRDY0_Msk               (_U_(0x1) << I2SMCC_IDRA_RXLRDY0_Pos)                /**< (I2SMCC_IDRA) I2S Receive Left 0 (x=0 only) or TDM Channel 2x Ready Interrupt Disable Mask */
#define I2SMCC_IDRA_RXLRDY0(value)            (I2SMCC_IDRA_RXLRDY0_Msk & ((value) << I2SMCC_IDRA_RXLRDY0_Pos))
#define I2SMCC_IDRA_RXRRDY0_Pos               _U_(17)                                              /**< (I2SMCC_IDRA) I2S Receive Right 0 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Disable Position */
#define I2SMCC_IDRA_RXRRDY0_Msk               (_U_(0x1) << I2SMCC_IDRA_RXRRDY0_Pos)                /**< (I2SMCC_IDRA) I2S Receive Right 0 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Disable Mask */
#define I2SMCC_IDRA_RXRRDY0(value)            (I2SMCC_IDRA_RXRRDY0_Msk & ((value) << I2SMCC_IDRA_RXRRDY0_Pos))
#define I2SMCC_IDRA_RXLRDY1_Pos               _U_(18)                                              /**< (I2SMCC_IDRA) I2S Receive Left 1 (x=0 only) or TDM Channel 2x Ready Interrupt Disable Position */
#define I2SMCC_IDRA_RXLRDY1_Msk               (_U_(0x1) << I2SMCC_IDRA_RXLRDY1_Pos)                /**< (I2SMCC_IDRA) I2S Receive Left 1 (x=0 only) or TDM Channel 2x Ready Interrupt Disable Mask */
#define I2SMCC_IDRA_RXLRDY1(value)            (I2SMCC_IDRA_RXLRDY1_Msk & ((value) << I2SMCC_IDRA_RXLRDY1_Pos))
#define I2SMCC_IDRA_RXRRDY1_Pos               _U_(19)                                              /**< (I2SMCC_IDRA) I2S Receive Right 1 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Disable Position */
#define I2SMCC_IDRA_RXRRDY1_Msk               (_U_(0x1) << I2SMCC_IDRA_RXRRDY1_Pos)                /**< (I2SMCC_IDRA) I2S Receive Right 1 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Disable Mask */
#define I2SMCC_IDRA_RXRRDY1(value)            (I2SMCC_IDRA_RXRRDY1_Msk & ((value) << I2SMCC_IDRA_RXRRDY1_Pos))
#define I2SMCC_IDRA_RXLRDY2_Pos               _U_(20)                                              /**< (I2SMCC_IDRA) I2S Receive Left 2 (x=0 only) or TDM Channel 2x Ready Interrupt Disable Position */
#define I2SMCC_IDRA_RXLRDY2_Msk               (_U_(0x1) << I2SMCC_IDRA_RXLRDY2_Pos)                /**< (I2SMCC_IDRA) I2S Receive Left 2 (x=0 only) or TDM Channel 2x Ready Interrupt Disable Mask */
#define I2SMCC_IDRA_RXLRDY2(value)            (I2SMCC_IDRA_RXLRDY2_Msk & ((value) << I2SMCC_IDRA_RXLRDY2_Pos))
#define I2SMCC_IDRA_RXRRDY2_Pos               _U_(21)                                              /**< (I2SMCC_IDRA) I2S Receive Right 2 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Disable Position */
#define I2SMCC_IDRA_RXRRDY2_Msk               (_U_(0x1) << I2SMCC_IDRA_RXRRDY2_Pos)                /**< (I2SMCC_IDRA) I2S Receive Right 2 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Disable Mask */
#define I2SMCC_IDRA_RXRRDY2(value)            (I2SMCC_IDRA_RXRRDY2_Msk & ((value) << I2SMCC_IDRA_RXRRDY2_Pos))
#define I2SMCC_IDRA_RXLRDY3_Pos               _U_(22)                                              /**< (I2SMCC_IDRA) I2S Receive Left 3 (x=0 only) or TDM Channel 2x Ready Interrupt Disable Position */
#define I2SMCC_IDRA_RXLRDY3_Msk               (_U_(0x1) << I2SMCC_IDRA_RXLRDY3_Pos)                /**< (I2SMCC_IDRA) I2S Receive Left 3 (x=0 only) or TDM Channel 2x Ready Interrupt Disable Mask */
#define I2SMCC_IDRA_RXLRDY3(value)            (I2SMCC_IDRA_RXLRDY3_Msk & ((value) << I2SMCC_IDRA_RXLRDY3_Pos))
#define I2SMCC_IDRA_RXRRDY3_Pos               _U_(23)                                              /**< (I2SMCC_IDRA) I2S Receive Right 3 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Disable Position */
#define I2SMCC_IDRA_RXRRDY3_Msk               (_U_(0x1) << I2SMCC_IDRA_RXRRDY3_Pos)                /**< (I2SMCC_IDRA) I2S Receive Right 3 (x=0 only) or TDM Channel [2x]+1 Ready Interrupt Disable Mask */
#define I2SMCC_IDRA_RXRRDY3(value)            (I2SMCC_IDRA_RXRRDY3_Msk & ((value) << I2SMCC_IDRA_RXRRDY3_Pos))
#define I2SMCC_IDRA_RXLOVF0_Pos               _U_(24)                                              /**< (I2SMCC_IDRA) I2S Receive Left 0 (x=0 only) or TDM Channel 2x Overrun Interrupt Disable Position */
#define I2SMCC_IDRA_RXLOVF0_Msk               (_U_(0x1) << I2SMCC_IDRA_RXLOVF0_Pos)                /**< (I2SMCC_IDRA) I2S Receive Left 0 (x=0 only) or TDM Channel 2x Overrun Interrupt Disable Mask */
#define I2SMCC_IDRA_RXLOVF0(value)            (I2SMCC_IDRA_RXLOVF0_Msk & ((value) << I2SMCC_IDRA_RXLOVF0_Pos))
#define I2SMCC_IDRA_RXROVF0_Pos               _U_(25)                                              /**< (I2SMCC_IDRA) I2S Receive Right 0 (x=0 only) or TDM Channel [2x]+1 Overrun Interrupt Disable Position */
#define I2SMCC_IDRA_RXROVF0_Msk               (_U_(0x1) << I2SMCC_IDRA_RXROVF0_Pos)                /**< (I2SMCC_IDRA) I2S Receive Right 0 (x=0 only) or TDM Channel [2x]+1 Overrun Interrupt Disable Mask */
#define I2SMCC_IDRA_RXROVF0(value)            (I2SMCC_IDRA_RXROVF0_Msk & ((value) << I2SMCC_IDRA_RXROVF0_Pos))
#define I2SMCC_IDRA_RXLOVF1_Pos               _U_(26)                                              /**< (I2SMCC_IDRA) I2S Receive Left 1 (x=0 only) or TDM Channel 2x Overrun Interrupt Disable Position */
#define I2SMCC_IDRA_RXLOVF1_Msk               (_U_(0x1) << I2SMCC_IDRA_RXLOVF1_Pos)                /**< (I2SMCC_IDRA) I2S Receive Left 1 (x=0 only) or TDM Channel 2x Overrun Interrupt Disable Mask */
#define I2SMCC_IDRA_RXLOVF1(value)            (I2SMCC_IDRA_RXLOVF1_Msk & ((value) << I2SMCC_IDRA_RXLOVF1_Pos))
#define I2SMCC_IDRA_RXROVF1_Pos               _U_(27)                                              /**< (I2SMCC_IDRA) I2S Receive Right 1 (x=0 only) or TDM Channel [2x]+1 Overrun Interrupt Disable Position */
#define I2SMCC_IDRA_RXROVF1_Msk               (_U_(0x1) << I2SMCC_IDRA_RXROVF1_Pos)                /**< (I2SMCC_IDRA) I2S Receive Right 1 (x=0 only) or TDM Channel [2x]+1 Overrun Interrupt Disable Mask */
#define I2SMCC_IDRA_RXROVF1(value)            (I2SMCC_IDRA_RXROVF1_Msk & ((value) << I2SMCC_IDRA_RXROVF1_Pos))
#define I2SMCC_IDRA_RXLOVF2_Pos               _U_(28)                                              /**< (I2SMCC_IDRA) I2S Receive Left 2 (x=0 only) or TDM Channel 2x Overrun Interrupt Disable Position */
#define I2SMCC_IDRA_RXLOVF2_Msk               (_U_(0x1) << I2SMCC_IDRA_RXLOVF2_Pos)                /**< (I2SMCC_IDRA) I2S Receive Left 2 (x=0 only) or TDM Channel 2x Overrun Interrupt Disable Mask */
#define I2SMCC_IDRA_RXLOVF2(value)            (I2SMCC_IDRA_RXLOVF2_Msk & ((value) << I2SMCC_IDRA_RXLOVF2_Pos))
#define I2SMCC_IDRA_RXROVF2_Pos               _U_(29)                                              /**< (I2SMCC_IDRA) I2S Receive Right 2 (x=0 only) or TDM Channel [2x]+1 Overrun Interrupt Disable Position */
#define I2SMCC_IDRA_RXROVF2_Msk               (_U_(0x1) << I2SMCC_IDRA_RXROVF2_Pos)                /**< (I2SMCC_IDRA) I2S Receive Right 2 (x=0 only) or TDM Channel [2x]+1 Overrun Interrupt Disable Mask */
#define I2SMCC_IDRA_RXROVF2(value)            (I2SMCC_IDRA_RXROVF2_Msk & ((value) << I2SMCC_IDRA_RXROVF2_Pos))
#define I2SMCC_IDRA_RXLOVF3_Pos               _U_(30)                                              /**< (I2SMCC_IDRA) I2S Receive Left 3 (x=0 only) or TDM Channel 2x Overrun Interrupt Disable Position */
#define I2SMCC_IDRA_RXLOVF3_Msk               (_U_(0x1) << I2SMCC_IDRA_RXLOVF3_Pos)                /**< (I2SMCC_IDRA) I2S Receive Left 3 (x=0 only) or TDM Channel 2x Overrun Interrupt Disable Mask */
#define I2SMCC_IDRA_RXLOVF3(value)            (I2SMCC_IDRA_RXLOVF3_Msk & ((value) << I2SMCC_IDRA_RXLOVF3_Pos))
#define I2SMCC_IDRA_RXROVF3_Pos               _U_(31)                                              /**< (I2SMCC_IDRA) I2S Receive Right 3 (x=0 only) or TDM Channel [2x]+1 Overrun Interrupt Disable Position */
#define I2SMCC_IDRA_RXROVF3_Msk               (_U_(0x1) << I2SMCC_IDRA_RXROVF3_Pos)                /**< (I2SMCC_IDRA) I2S Receive Right 3 (x=0 only) or TDM Channel [2x]+1 Overrun Interrupt Disable Mask */
#define I2SMCC_IDRA_RXROVF3(value)            (I2SMCC_IDRA_RXROVF3_Msk & ((value) << I2SMCC_IDRA_RXROVF3_Pos))
#define I2SMCC_IDRA_Msk                       _U_(0xFFFFFFFF)                                      /**< (I2SMCC_IDRA) Register Mask  */


