Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/i2smcc.h
/* -------- I2SMCC_ISRA : (I2SMCC Offset: 0x1C) ( R/ 32) Interrupt Status Register A -------- */
#define I2SMCC_ISRA_TXLRDY0_Pos               _U_(0)                                               /**< (I2SMCC_ISRA) I2S Transmit Left 0 (x=0 only) or TDM Channel 2x Ready Flag (Cleared by writing I2SMCC_THR) Position */
#define I2SMCC_ISRA_TXLRDY0_Msk               (_U_(0x1) << I2SMCC_ISRA_TXLRDY0_Pos)                /**< (I2SMCC_ISRA) I2S Transmit Left 0 (x=0 only) or TDM Channel 2x Ready Flag (Cleared by writing I2SMCC_THR) Mask */
#define I2SMCC_ISRA_TXLRDY0(value)            (I2SMCC_ISRA_TXLRDY0_Msk & ((value) << I2SMCC_ISRA_TXLRDY0_Pos))
#define I2SMCC_ISRA_TXRRDY0_Pos               _U_(1)                                               /**< (I2SMCC_ISRA) I2S Transmit Right 0 (x=0 only) or TDM Channel [2x]+1 Ready Flag (Cleared by writing I2SMCC_THR) Position */
#define I2SMCC_ISRA_TXRRDY0_Msk               (_U_(0x1) << I2SMCC_ISRA_TXRRDY0_Pos)                /**< (I2SMCC_ISRA) I2S Transmit Right 0 (x=0 only) or TDM Channel [2x]+1 Ready Flag (Cleared by writing I2SMCC_THR) Mask */
#define I2SMCC_ISRA_TXRRDY0(value)            (I2SMCC_ISRA_TXRRDY0_Msk & ((value) << I2SMCC_ISRA_TXRRDY0_Pos))
#define I2SMCC_ISRA_TXLRDY1_Pos               _U_(2)                                               /**< (I2SMCC_ISRA) I2S Transmit Left 1 (x=0 only) or TDM Channel 2x Ready Flag (Cleared by writing I2SMCC_THR) Position */
#define I2SMCC_ISRA_TXLRDY1_Msk               (_U_(0x1) << I2SMCC_ISRA_TXLRDY1_Pos)                /**< (I2SMCC_ISRA) I2S Transmit Left 1 (x=0 only) or TDM Channel 2x Ready Flag (Cleared by writing I2SMCC_THR) Mask */
#define I2SMCC_ISRA_TXLRDY1(value)            (I2SMCC_ISRA_TXLRDY1_Msk & ((value) << I2SMCC_ISRA_TXLRDY1_Pos))
#define I2SMCC_ISRA_TXRRDY1_Pos               _U_(3)                                               /**< (I2SMCC_ISRA) I2S Transmit Right 1 (x=0 only) or TDM Channel [2x]+1 Ready Flag (Cleared by writing I2SMCC_THR) Position */
#define I2SMCC_ISRA_TXRRDY1_Msk               (_U_(0x1) << I2SMCC_ISRA_TXRRDY1_Pos)                /**< (I2SMCC_ISRA) I2S Transmit Right 1 (x=0 only) or TDM Channel [2x]+1 Ready Flag (Cleared by writing I2SMCC_THR) Mask */
#define I2SMCC_ISRA_TXRRDY1(value)            (I2SMCC_ISRA_TXRRDY1_Msk & ((value) << I2SMCC_ISRA_TXRRDY1_Pos))
#define I2SMCC_ISRA_TXLRDY2_Pos               _U_(4)                                               /**< (I2SMCC_ISRA) I2S Transmit Left 2 (x=0 only) or TDM Channel 2x Ready Flag (Cleared by writing I2SMCC_THR) Position */
#define I2SMCC_ISRA_TXLRDY2_Msk               (_U_(0x1) << I2SMCC_ISRA_TXLRDY2_Pos)                /**< (I2SMCC_ISRA) I2S Transmit Left 2 (x=0 only) or TDM Channel 2x Ready Flag (Cleared by writing I2SMCC_THR) Mask */
#define I2SMCC_ISRA_TXLRDY2(value)            (I2SMCC_ISRA_TXLRDY2_Msk & ((value) << I2SMCC_ISRA_TXLRDY2_Pos))
#define I2SMCC_ISRA_TXRRDY2_Pos               _U_(5)                                               /**< (I2SMCC_ISRA) I2S Transmit Right 2 (x=0 only) or TDM Channel [2x]+1 Ready Flag (Cleared by writing I2SMCC_THR) Position */
#define I2SMCC_ISRA_TXRRDY2_Msk               (_U_(0x1) << I2SMCC_ISRA_TXRRDY2_Pos)                /**< (I2SMCC_ISRA) I2S Transmit Right 2 (x=0 only) or TDM Channel [2x]+1 Ready Flag (Cleared by writing I2SMCC_THR) Mask */
#define I2SMCC_ISRA_TXRRDY2(value)            (I2SMCC_ISRA_TXRRDY2_Msk & ((value) << I2SMCC_ISRA_TXRRDY2_Pos))
#define I2SMCC_ISRA_TXLRDY3_Pos               _U_(6)                                               /**< (I2SMCC_ISRA) I2S Transmit Left 3 (x=0 only) or TDM Channel 2x Ready Flag (Cleared by writing I2SMCC_THR) Position */
#define I2SMCC_ISRA_TXLRDY3_Msk               (_U_(0x1) << I2SMCC_ISRA_TXLRDY3_Pos)                /**< (I2SMCC_ISRA) I2S Transmit Left 3 (x=0 only) or TDM Channel 2x Ready Flag (Cleared by writing I2SMCC_THR) Mask */
#define I2SMCC_ISRA_TXLRDY3(value)            (I2SMCC_ISRA_TXLRDY3_Msk & ((value) << I2SMCC_ISRA_TXLRDY3_Pos))
#define I2SMCC_ISRA_TXRRDY3_Pos               _U_(7)                                               /**< (I2SMCC_ISRA) I2S Transmit Right 3 (x=0 only) or TDM Channel [2x]+1 Ready Flag (Cleared by writing I2SMCC_THR) Position */
#define I2SMCC_ISRA_TXRRDY3_Msk               (_U_(0x1) << I2SMCC_ISRA_TXRRDY3_Pos)                /**< (I2SMCC_ISRA) I2S Transmit Right 3 (x=0 only) or TDM Channel [2x]+1 Ready Flag (Cleared by writing I2SMCC_THR) Mask */
#define I2SMCC_ISRA_TXRRDY3(value)            (I2SMCC_ISRA_TXRRDY3_Msk & ((value) << I2SMCC_ISRA_TXRRDY3_Pos))
#define I2SMCC_ISRA_TXLUNF0_Pos               _U_(8)                                               /**< (I2SMCC_ISRA) I2S Transmit Left 0 (x=0 only) or TDM Channel 2x Underrun (Cleared on read) Position */
#define I2SMCC_ISRA_TXLUNF0_Msk               (_U_(0x1) << I2SMCC_ISRA_TXLUNF0_Pos)                /**< (I2SMCC_ISRA) I2S Transmit Left 0 (x=0 only) or TDM Channel 2x Underrun (Cleared on read) Mask */
#define I2SMCC_ISRA_TXLUNF0(value)            (I2SMCC_ISRA_TXLUNF0_Msk & ((value) << I2SMCC_ISRA_TXLUNF0_Pos))
#define I2SMCC_ISRA_TXRUNF0_Pos               _U_(9)                                               /**< (I2SMCC_ISRA) I2S Transmit Right 0 (x=0 only) or TDM Channel [2x]+1 Underrun Flag (Cleared on read) Position */
#define I2SMCC_ISRA_TXRUNF0_Msk               (_U_(0x1) << I2SMCC_ISRA_TXRUNF0_Pos)                /**< (I2SMCC_ISRA) I2S Transmit Right 0 (x=0 only) or TDM Channel [2x]+1 Underrun Flag (Cleared on read) Mask */
#define I2SMCC_ISRA_TXRUNF0(value)            (I2SMCC_ISRA_TXRUNF0_Msk & ((value) << I2SMCC_ISRA_TXRUNF0_Pos))
#define I2SMCC_ISRA_TXLUNF1_Pos               _U_(10)                                              /**< (I2SMCC_ISRA) I2S Transmit Left 1 (x=0 only) or TDM Channel 2x Underrun (Cleared on read) Position */
#define I2SMCC_ISRA_TXLUNF1_Msk               (_U_(0x1) << I2SMCC_ISRA_TXLUNF1_Pos)                /**< (I2SMCC_ISRA) I2S Transmit Left 1 (x=0 only) or TDM Channel 2x Underrun (Cleared on read) Mask */
#define I2SMCC_ISRA_TXLUNF1(value)            (I2SMCC_ISRA_TXLUNF1_Msk & ((value) << I2SMCC_ISRA_TXLUNF1_Pos))
#define I2SMCC_ISRA_TXRUNF1_Pos               _U_(11)                                              /**< (I2SMCC_ISRA) I2S Transmit Right 1 (x=0 only) or TDM Channel [2x]+1 Underrun Flag (Cleared on read) Position */
#define I2SMCC_ISRA_TXRUNF1_Msk               (_U_(0x1) << I2SMCC_ISRA_TXRUNF1_Pos)                /**< (I2SMCC_ISRA) I2S Transmit Right 1 (x=0 only) or TDM Channel [2x]+1 Underrun Flag (Cleared on read) Mask */
#define I2SMCC_ISRA_TXRUNF1(value)            (I2SMCC_ISRA_TXRUNF1_Msk & ((value) << I2SMCC_ISRA_TXRUNF1_Pos))
#define I2SMCC_ISRA_TXLUNF2_Pos               _U_(12)                                              /**< (I2SMCC_ISRA) I2S Transmit Left 2 (x=0 only) or TDM Channel 2x Underrun (Cleared on read) Position */
#define I2SMCC_ISRA_TXLUNF2_Msk               (_U_(0x1) << I2SMCC_ISRA_TXLUNF2_Pos)                /**< (I2SMCC_ISRA) I2S Transmit Left 2 (x=0 only) or TDM Channel 2x Underrun (Cleared on read) Mask */
#define I2SMCC_ISRA_TXLUNF2(value)            (I2SMCC_ISRA_TXLUNF2_Msk & ((value) << I2SMCC_ISRA_TXLUNF2_Pos))
#define I2SMCC_ISRA_TXRUNF2_Pos               _U_(13)                                              /**< (I2SMCC_ISRA) I2S Transmit Right 2 (x=0 only) or TDM Channel [2x]+1 Underrun Flag (Cleared on read) Position */
#define I2SMCC_ISRA_TXRUNF2_Msk               (_U_(0x1) << I2SMCC_ISRA_TXRUNF2_Pos)                /**< (I2SMCC_ISRA) I2S Transmit Right 2 (x=0 only) or TDM Channel [2x]+1 Underrun Flag (Cleared on read) Mask */
#define I2SMCC_ISRA_TXRUNF2(value)            (I2SMCC_ISRA_TXRUNF2_Msk & ((value) << I2SMCC_ISRA_TXRUNF2_Pos))
#define I2SMCC_ISRA_TXLUNF3_Pos               _U_(14)                                              /**< (I2SMCC_ISRA) I2S Transmit Left 3 (x=0 only) or TDM Channel 2x Underrun (Cleared on read) Position */
#define I2SMCC_ISRA_TXLUNF3_Msk               (_U_(0x1) << I2SMCC_ISRA_TXLUNF3_Pos)                /**< (I2SMCC_ISRA) I2S Transmit Left 3 (x=0 only) or TDM Channel 2x Underrun (Cleared on read) Mask */
#define I2SMCC_ISRA_TXLUNF3(value)            (I2SMCC_ISRA_TXLUNF3_Msk & ((value) << I2SMCC_ISRA_TXLUNF3_Pos))
#define I2SMCC_ISRA_TXRUNF3_Pos               _U_(15)                                              /**< (I2SMCC_ISRA) I2S Transmit Right 3 (x=0 only) or TDM Channel [2x]+1 Underrun Flag (Cleared on read) Position */
#define I2SMCC_ISRA_TXRUNF3_Msk               (_U_(0x1) << I2SMCC_ISRA_TXRUNF3_Pos)                /**< (I2SMCC_ISRA) I2S Transmit Right 3 (x=0 only) or TDM Channel [2x]+1 Underrun Flag (Cleared on read) Mask */
#define I2SMCC_ISRA_TXRUNF3(value)            (I2SMCC_ISRA_TXRUNF3_Msk & ((value) << I2SMCC_ISRA_TXRUNF3_Pos))
#define I2SMCC_ISRA_RXLRDY0_Pos               _U_(16)                                              /**< (I2SMCC_ISRA) I2S Receive Left 0 (x=0 only) or TDM Channel 2x Ready Flag (Cleared by reading I2SMCC_RHR) Position */
#define I2SMCC_ISRA_RXLRDY0_Msk               (_U_(0x1) << I2SMCC_ISRA_RXLRDY0_Pos)                /**< (I2SMCC_ISRA) I2S Receive Left 0 (x=0 only) or TDM Channel 2x Ready Flag (Cleared by reading I2SMCC_RHR) Mask */
#define I2SMCC_ISRA_RXLRDY0(value)            (I2SMCC_ISRA_RXLRDY0_Msk & ((value) << I2SMCC_ISRA_RXLRDY0_Pos))
#define I2SMCC_ISRA_RXRRDY0_Pos               _U_(17)                                              /**< (I2SMCC_ISRA) I2S Receive Right 0 (x=0 only) or TDM Channel [2x]+1 Ready Flag (Cleared by reading I2SMCC_RHR) Position */
#define I2SMCC_ISRA_RXRRDY0_Msk               (_U_(0x1) << I2SMCC_ISRA_RXRRDY0_Pos)                /**< (I2SMCC_ISRA) I2S Receive Right 0 (x=0 only) or TDM Channel [2x]+1 Ready Flag (Cleared by reading I2SMCC_RHR) Mask */
#define I2SMCC_ISRA_RXRRDY0(value)            (I2SMCC_ISRA_RXRRDY0_Msk & ((value) << I2SMCC_ISRA_RXRRDY0_Pos))
#define I2SMCC_ISRA_RXLRDY1_Pos               _U_(18)                                              /**< (I2SMCC_ISRA) I2S Receive Left 1 (x=0 only) or TDM Channel 2x Ready Flag (Cleared by reading I2SMCC_RHR) Position */
#define I2SMCC_ISRA_RXLRDY1_Msk               (_U_(0x1) << I2SMCC_ISRA_RXLRDY1_Pos)                /**< (I2SMCC_ISRA) I2S Receive Left 1 (x=0 only) or TDM Channel 2x Ready Flag (Cleared by reading I2SMCC_RHR) Mask */
#define I2SMCC_ISRA_RXLRDY1(value)            (I2SMCC_ISRA_RXLRDY1_Msk & ((value) << I2SMCC_ISRA_RXLRDY1_Pos))
#define I2SMCC_ISRA_RXRRDY1_Pos               _U_(19)                                              /**< (I2SMCC_ISRA) I2S Receive Right 1 (x=0 only) or TDM Channel [2x]+1 Ready Flag (Cleared by reading I2SMCC_RHR) Position */
#define I2SMCC_ISRA_RXRRDY1_Msk               (_U_(0x1) << I2SMCC_ISRA_RXRRDY1_Pos)                /**< (I2SMCC_ISRA) I2S Receive Right 1 (x=0 only) or TDM Channel [2x]+1 Ready Flag (Cleared by reading I2SMCC_RHR) Mask */
#define I2SMCC_ISRA_RXRRDY1(value)            (I2SMCC_ISRA_RXRRDY1_Msk & ((value) << I2SMCC_ISRA_RXRRDY1_Pos))
#define I2SMCC_ISRA_RXLRDY2_Pos               _U_(20)                                              /**< (I2SMCC_ISRA) I2S Receive Left 2 (x=0 only) or TDM Channel 2x Ready Flag (Cleared by reading I2SMCC_RHR) Position */
#define I2SMCC_ISRA_RXLRDY2_Msk               (_U_(0x1) << I2SMCC_ISRA_RXLRDY2_Pos)                /**< (I2SMCC_ISRA) I2S Receive Left 2 (x=0 only) or TDM Channel 2x Ready Flag (Cleared by reading I2SMCC_RHR) Mask */
#define I2SMCC_ISRA_RXLRDY2(value)            (I2SMCC_ISRA_RXLRDY2_Msk & ((value) << I2SMCC_ISRA_RXLRDY2_Pos))
#define I2SMCC_ISRA_RXRRDY2_Pos               _U_(21)                                              /**< (I2SMCC_ISRA) I2S Receive Right 2 (x=0 only) or TDM Channel [2x]+1 Ready Flag (Cleared by reading I2SMCC_RHR) Position */
#define I2SMCC_ISRA_RXRRDY2_Msk               (_U_(0x1) << I2SMCC_ISRA_RXRRDY2_Pos)                /**< (I2SMCC_ISRA) I2S Receive Right 2 (x=0 only) or TDM Channel [2x]+1 Ready Flag (Cleared by reading I2SMCC_RHR) Mask */
#define I2SMCC_ISRA_RXRRDY2(value)            (I2SMCC_ISRA_RXRRDY2_Msk & ((value) << I2SMCC_ISRA_RXRRDY2_Pos))
#define I2SMCC_ISRA_RXLRDY3_Pos               _U_(22)                                              /**< (I2SMCC_ISRA) I2S Receive Left 3 (x=0 only) or TDM Channel 2x Ready Flag (Cleared by reading I2SMCC_RHR) Position */
#define I2SMCC_ISRA_RXLRDY3_Msk               (_U_(0x1) << I2SMCC_ISRA_RXLRDY3_Pos)                /**< (I2SMCC_ISRA) I2S Receive Left 3 (x=0 only) or TDM Channel 2x Ready Flag (Cleared by reading I2SMCC_RHR) Mask */
#define I2SMCC_ISRA_RXLRDY3(value)            (I2SMCC_ISRA_RXLRDY3_Msk & ((value) << I2SMCC_ISRA_RXLRDY3_Pos))
#define I2SMCC_ISRA_RXRRDY3_Pos               _U_(23)                                              /**< (I2SMCC_ISRA) I2S Receive Right 3 (x=0 only) or TDM Channel [2x]+1 Ready Flag (Cleared by reading I2SMCC_RHR) Position */
#define I2SMCC_ISRA_RXRRDY3_Msk               (_U_(0x1) << I2SMCC_ISRA_RXRRDY3_Pos)                /**< (I2SMCC_ISRA) I2S Receive Right 3 (x=0 only) or TDM Channel [2x]+1 Ready Flag (Cleared by reading I2SMCC_RHR) Mask */
#define I2SMCC_ISRA_RXRRDY3(value)            (I2SMCC_ISRA_RXRRDY3_Msk & ((value) << I2SMCC_ISRA_RXRRDY3_Pos))
#define I2SMCC_ISRA_RXLOVF0_Pos               _U_(24)                                              /**< (I2SMCC_ISRA) I2S Receive Left 0 (x=0 only) or TDM Channel 2x Overrun Flag (Cleared on read) Position */
#define I2SMCC_ISRA_RXLOVF0_Msk               (_U_(0x1) << I2SMCC_ISRA_RXLOVF0_Pos)                /**< (I2SMCC_ISRA) I2S Receive Left 0 (x=0 only) or TDM Channel 2x Overrun Flag (Cleared on read) Mask */
#define I2SMCC_ISRA_RXLOVF0(value)            (I2SMCC_ISRA_RXLOVF0_Msk & ((value) << I2SMCC_ISRA_RXLOVF0_Pos))
#define I2SMCC_ISRA_RXROVF0_Pos               _U_(25)                                              /**< (I2SMCC_ISRA) I2S Receive Right 0 (x=0 only) or TDM Channel [2x]+1 Overrun Flag (Cleared on read) Position */
#define I2SMCC_ISRA_RXROVF0_Msk               (_U_(0x1) << I2SMCC_ISRA_RXROVF0_Pos)                /**< (I2SMCC_ISRA) I2S Receive Right 0 (x=0 only) or TDM Channel [2x]+1 Overrun Flag (Cleared on read) Mask */
#define I2SMCC_ISRA_RXROVF0(value)            (I2SMCC_ISRA_RXROVF0_Msk & ((value) << I2SMCC_ISRA_RXROVF0_Pos))
#define I2SMCC_ISRA_RXLOVF1_Pos               _U_(26)                                              /**< (I2SMCC_ISRA) I2S Receive Left 1 (x=0 only) or TDM Channel 2x Overrun Flag (Cleared on read) Position */
#define I2SMCC_ISRA_RXLOVF1_Msk               (_U_(0x1) << I2SMCC_ISRA_RXLOVF1_Pos)                /**< (I2SMCC_ISRA) I2S Receive Left 1 (x=0 only) or TDM Channel 2x Overrun Flag (Cleared on read) Mask */
#define I2SMCC_ISRA_RXLOVF1(value)            (I2SMCC_ISRA_RXLOVF1_Msk & ((value) << I2SMCC_ISRA_RXLOVF1_Pos))
#define I2SMCC_ISRA_RXROVF1_Pos               _U_(27)                                              /**< (I2SMCC_ISRA) I2S Receive Right 1 (x=0 only) or TDM Channel [2x]+1 Overrun Flag (Cleared on read) Position */
#define I2SMCC_ISRA_RXROVF1_Msk               (_U_(0x1) << I2SMCC_ISRA_RXROVF1_Pos)                /**< (I2SMCC_ISRA) I2S Receive Right 1 (x=0 only) or TDM Channel [2x]+1 Overrun Flag (Cleared on read) Mask */
#define I2SMCC_ISRA_RXROVF1(value)            (I2SMCC_ISRA_RXROVF1_Msk & ((value) << I2SMCC_ISRA_RXROVF1_Pos))
#define I2SMCC_ISRA_RXLOVF2_Pos               _U_(28)                                              /**< (I2SMCC_ISRA) I2S Receive Left 2 (x=0 only) or TDM Channel 2x Overrun Flag (Cleared on read) Position */
#define I2SMCC_ISRA_RXLOVF2_Msk               (_U_(0x1) << I2SMCC_ISRA_RXLOVF2_Pos)                /**< (I2SMCC_ISRA) I2S Receive Left 2 (x=0 only) or TDM Channel 2x Overrun Flag (Cleared on read) Mask */
#define I2SMCC_ISRA_RXLOVF2(value)            (I2SMCC_ISRA_RXLOVF2_Msk & ((value) << I2SMCC_ISRA_RXLOVF2_Pos))
#define I2SMCC_ISRA_RXROVF2_Pos               _U_(29)                                              /**< (I2SMCC_ISRA) I2S Receive Right 2 (x=0 only) or TDM Channel [2x]+1 Overrun Flag (Cleared on read) Position */
#define I2SMCC_ISRA_RXROVF2_Msk               (_U_(0x1) << I2SMCC_ISRA_RXROVF2_Pos)                /**< (I2SMCC_ISRA) I2S Receive Right 2 (x=0 only) or TDM Channel [2x]+1 Overrun Flag (Cleared on read) Mask */
#define I2SMCC_ISRA_RXROVF2(value)            (I2SMCC_ISRA_RXROVF2_Msk & ((value) << I2SMCC_ISRA_RXROVF2_Pos))
#define I2SMCC_ISRA_RXLOVF3_Pos               _U_(30)                                              /**< (I2SMCC_ISRA) I2S Receive Left 3 (x=0 only) or TDM Channel 2x Overrun Flag (Cleared on read) Position */
#define I2SMCC_ISRA_RXLOVF3_Msk               (_U_(0x1) << I2SMCC_ISRA_RXLOVF3_Pos)                /**< (I2SMCC_ISRA) I2S Receive Left 3 (x=0 only) or TDM Channel 2x Overrun Flag (Cleared on read) Mask */
#define I2SMCC_ISRA_RXLOVF3(value)            (I2SMCC_ISRA_RXLOVF3_Msk & ((value) << I2SMCC_ISRA_RXLOVF3_Pos))
#define I2SMCC_ISRA_RXROVF3_Pos               _U_(31)                                              /**< (I2SMCC_ISRA) I2S Receive Right 3 (x=0 only) or TDM Channel [2x]+1 Overrun Flag (Cleared on read) Position */
#define I2SMCC_ISRA_RXROVF3_Msk               (_U_(0x1) << I2SMCC_ISRA_RXROVF3_Pos)                /**< (I2SMCC_ISRA) I2S Receive Right 3 (x=0 only) or TDM Channel [2x]+1 Overrun Flag (Cleared on read) Mask */
#define I2SMCC_ISRA_RXROVF3(value)            (I2SMCC_ISRA_RXROVF3_Msk & ((value) << I2SMCC_ISRA_RXROVF3_Pos))
#define I2SMCC_ISRA_Msk                       _U_(0xFFFFFFFF)                                      /**< (I2SMCC_ISRA) Register Mask  */


/* -------- I2SMCC_IERB : (I2SMCC Offset: 0x20) ( /W 32) Interrupt Enable Register B -------- */
#define I2SMCC_IERB_WERR_Pos                  _U_(0)                                               /**< (I2SMCC_IERB) Write Error Interrupt Enable Position */
#define I2SMCC_IERB_WERR_Msk                  (_U_(0x1) << I2SMCC_IERB_WERR_Pos)                   /**< (I2SMCC_IERB) Write Error Interrupt Enable Mask */
#define I2SMCC_IERB_WERR(value)               (I2SMCC_IERB_WERR_Msk & ((value) << I2SMCC_IERB_WERR_Pos))
#define I2SMCC_IERB_Msk                       _U_(0x00000001)                                      /**< (I2SMCC_IERB) Register Mask  */


/* -------- I2SMCC_IDRB : (I2SMCC Offset: 0x24) ( /W 32) Interrupt Disable Register B -------- */
#define I2SMCC_IDRB_WERR_Pos                  _U_(0)                                               /**< (I2SMCC_IDRB) Write Error Interrupt Disable Position */
#define I2SMCC_IDRB_WERR_Msk                  (_U_(0x1) << I2SMCC_IDRB_WERR_Pos)                   /**< (I2SMCC_IDRB) Write Error Interrupt Disable Mask */
#define I2SMCC_IDRB_WERR(value)               (I2SMCC_IDRB_WERR_Msk & ((value) << I2SMCC_IDRB_WERR_Pos))
#define I2SMCC_IDRB_Msk                       _U_(0x00000001)                                      /**< (I2SMCC_IDRB) Register Mask  */


/* -------- I2SMCC_IMRB : (I2SMCC Offset: 0x28) ( R/ 32) Interrupt Mask Register B -------- */
#define I2SMCC_IMRB_WERR_Pos                  _U_(0)                                               /**< (I2SMCC_IMRB) Write Error Interrupt Mask Position */
#define I2SMCC_IMRB_WERR_Msk                  (_U_(0x1) << I2SMCC_IMRB_WERR_Pos)                   /**< (I2SMCC_IMRB) Write Error Interrupt Mask Mask */
#define I2SMCC_IMRB_WERR(value)               (I2SMCC_IMRB_WERR_Msk & ((value) << I2SMCC_IMRB_WERR_Pos))
#define I2SMCC_IMRB_Msk                       _U_(0x00000001)                                      /**< (I2SMCC_IMRB) Register Mask  */


/* -------- I2SMCC_ISRB : (I2SMCC Offset: 0x2C) ( R/ 32) Interrupt Status Register B -------- */
#define I2SMCC_ISRB_WERR_Pos                  _U_(0)                                               /**< (I2SMCC_ISRB) Write Error Flag (Cleared on read) Position */
#define I2SMCC_ISRB_WERR_Msk                  (_U_(0x1) << I2SMCC_ISRB_WERR_Pos)                   /**< (I2SMCC_ISRB) Write Error Flag (Cleared on read) Mask */
#define I2SMCC_ISRB_WERR(value)               (I2SMCC_ISRB_WERR_Msk & ((value) << I2SMCC_ISRB_WERR_Pos))
#define I2SMCC_ISRB_Msk                       _U_(0x00000001)                                      /**< (I2SMCC_ISRB) Register Mask  */


/* -------- I2SMCC_RHR : (I2SMCC Offset: 0x30) ( R/ 32) Receiver Holding Register -------- */
#define I2SMCC_RHR_RHR_Pos                    _U_(0)                                               /**< (I2SMCC_RHR) Receiver Holding Register Position */
#define I2SMCC_RHR_RHR_Msk                    (_U_(0xFFFFFFFF) << I2SMCC_RHR_RHR_Pos)              /**< (I2SMCC_RHR) Receiver Holding Register Mask */
#define I2SMCC_RHR_RHR(value)                 (I2SMCC_RHR_RHR_Msk & ((value) << I2SMCC_RHR_RHR_Pos))
#define I2SMCC_RHR_Msk                        _U_(0xFFFFFFFF)                                      /**< (I2SMCC_RHR) Register Mask  */


