Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/i2smcc.h
/* -------- I2SMCC_THR : (I2SMCC Offset: 0x34) ( /W 32) Transmitter Holding Register -------- */
#define I2SMCC_THR_THR_Pos                    _U_(0)                                               /**< (I2SMCC_THR) Transmitter Holding Register Position */
#define I2SMCC_THR_THR_Msk                    (_U_(0xFFFFFFFF) << I2SMCC_THR_THR_Pos)              /**< (I2SMCC_THR) Transmitter Holding Register Mask */
#define I2SMCC_THR_THR(value)                 (I2SMCC_THR_THR_Msk & ((value) << I2SMCC_THR_THR_Pos))
#define I2SMCC_THR_Msk                        _U_(0xFFFFFFFF)                                      /**< (I2SMCC_THR) Register Mask  */


/* -------- I2SMCC_WPMR : (I2SMCC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define I2SMCC_WPMR_WPCFEN_Pos                _U_(0)                                               /**< (I2SMCC_WPMR) Write Protection Configuration Enable Position */
#define I2SMCC_WPMR_WPCFEN_Msk                (_U_(0x1) << I2SMCC_WPMR_WPCFEN_Pos)                 /**< (I2SMCC_WPMR) Write Protection Configuration Enable Mask */
#define I2SMCC_WPMR_WPCFEN(value)             (I2SMCC_WPMR_WPCFEN_Msk & ((value) << I2SMCC_WPMR_WPCFEN_Pos))
#define I2SMCC_WPMR_WPITEN_Pos                _U_(1)                                               /**< (I2SMCC_WPMR) Write Protection Interrupt Enable Position */
#define I2SMCC_WPMR_WPITEN_Msk                (_U_(0x1) << I2SMCC_WPMR_WPITEN_Pos)                 /**< (I2SMCC_WPMR) Write Protection Interrupt Enable Mask */
#define I2SMCC_WPMR_WPITEN(value)             (I2SMCC_WPMR_WPITEN_Msk & ((value) << I2SMCC_WPMR_WPITEN_Pos))
#define I2SMCC_WPMR_WPCTEN_Pos                _U_(2)                                               /**< (I2SMCC_WPMR) Write Protection Control Enable Position */
#define I2SMCC_WPMR_WPCTEN_Msk                (_U_(0x1) << I2SMCC_WPMR_WPCTEN_Pos)                 /**< (I2SMCC_WPMR) Write Protection Control Enable Mask */
#define I2SMCC_WPMR_WPCTEN(value)             (I2SMCC_WPMR_WPCTEN_Msk & ((value) << I2SMCC_WPMR_WPCTEN_Pos))
#define I2SMCC_WPMR_WPKEY_Pos                 _U_(8)                                               /**< (I2SMCC_WPMR) Write Protection Key Position */
#define I2SMCC_WPMR_WPKEY_Msk                 (_U_(0xFFFFFF) << I2SMCC_WPMR_WPKEY_Pos)             /**< (I2SMCC_WPMR) Write Protection Key Mask */
#define I2SMCC_WPMR_WPKEY(value)              (I2SMCC_WPMR_WPKEY_Msk & ((value) << I2SMCC_WPMR_WPKEY_Pos))
#define   I2SMCC_WPMR_WPKEY_PASSWD_Val        _U_(0x493253)                                        /**< (I2SMCC_WPMR) Writing any other value in this field aborts the write operation.Always reads as 0.  */
#define I2SMCC_WPMR_WPKEY_PASSWD              (I2SMCC_WPMR_WPKEY_PASSWD_Val << I2SMCC_WPMR_WPKEY_Pos) /**< (I2SMCC_WPMR) Writing any other value in this field aborts the write operation.Always reads as 0. Position  */
#define I2SMCC_WPMR_Msk                       _U_(0xFFFFFF07)                                      /**< (I2SMCC_WPMR) Register Mask  */


/* -------- I2SMCC_WPSR : (I2SMCC Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define I2SMCC_WPSR_WPVS_Pos                  _U_(0)                                               /**< (I2SMCC_WPSR) Write Protection Violation Status Position */
#define I2SMCC_WPSR_WPVS_Msk                  (_U_(0x1) << I2SMCC_WPSR_WPVS_Pos)                   /**< (I2SMCC_WPSR) Write Protection Violation Status Mask */
#define I2SMCC_WPSR_WPVS(value)               (I2SMCC_WPSR_WPVS_Msk & ((value) << I2SMCC_WPSR_WPVS_Pos))
#define I2SMCC_WPSR_WPVSRC_Pos                _U_(8)                                               /**< (I2SMCC_WPSR) Write Protection Violation Source Position */
#define I2SMCC_WPSR_WPVSRC_Msk                (_U_(0xFFFFFF) << I2SMCC_WPSR_WPVSRC_Pos)            /**< (I2SMCC_WPSR) Write Protection Violation Source Mask */
#define I2SMCC_WPSR_WPVSRC(value)             (I2SMCC_WPSR_WPVSRC_Msk & ((value) << I2SMCC_WPSR_WPVSRC_Pos))
#define I2SMCC_WPSR_Msk                       _U_(0xFFFFFF01)                                      /**< (I2SMCC_WPSR) Register Mask  */


/* -------- I2SMCC_VERSION : (I2SMCC Offset: 0xFC) ( R/ 32) Version Register -------- */
#define I2SMCC_VERSION_VERSION_Pos            _U_(0)                                               /**< (I2SMCC_VERSION) Version of the Hardware Module Position */
#define I2SMCC_VERSION_VERSION_Msk            (_U_(0xFFF) << I2SMCC_VERSION_VERSION_Pos)           /**< (I2SMCC_VERSION) Version of the Hardware Module Mask */
#define I2SMCC_VERSION_VERSION(value)         (I2SMCC_VERSION_VERSION_Msk & ((value) << I2SMCC_VERSION_VERSION_Pos))
#define I2SMCC_VERSION_MFN_Pos                _U_(16)                                              /**< (I2SMCC_VERSION) Metal Fix Number Position */
#define I2SMCC_VERSION_MFN_Msk                (_U_(0x7) << I2SMCC_VERSION_MFN_Pos)                 /**< (I2SMCC_VERSION) Metal Fix Number Mask */
#define I2SMCC_VERSION_MFN(value)             (I2SMCC_VERSION_MFN_Msk & ((value) << I2SMCC_VERSION_MFN_Pos))
#define I2SMCC_VERSION_Msk                    _U_(0x00070FFF)                                      /**< (I2SMCC_VERSION) Register Mask  */


/** \brief I2SMCC register offsets definitions */
#define I2SMCC_CR_REG_OFST             (0x00)              /**< (I2SMCC_CR) Control Register Offset */
#define I2SMCC_MRA_REG_OFST            (0x04)              /**< (I2SMCC_MRA) Mode Register A Offset */
#define I2SMCC_MRB_REG_OFST            (0x08)              /**< (I2SMCC_MRB) Mode Register B Offset */
#define I2SMCC_SR_REG_OFST             (0x0C)              /**< (I2SMCC_SR) Status Register Offset */
#define I2SMCC_IERA_REG_OFST           (0x10)              /**< (I2SMCC_IERA) Interrupt Enable Register A Offset */
#define I2SMCC_IDRA_REG_OFST           (0x14)              /**< (I2SMCC_IDRA) Interrupt Disable Register A Offset */
#define I2SMCC_IMRA_REG_OFST           (0x18)              /**< (I2SMCC_IMRA) Interrupt Mask Register A Offset */
#define I2SMCC_ISRA_REG_OFST           (0x1C)              /**< (I2SMCC_ISRA) Interrupt Status Register A Offset */
#define I2SMCC_IERB_REG_OFST           (0x20)              /**< (I2SMCC_IERB) Interrupt Enable Register B Offset */
#define I2SMCC_IDRB_REG_OFST           (0x24)              /**< (I2SMCC_IDRB) Interrupt Disable Register B Offset */
#define I2SMCC_IMRB_REG_OFST           (0x28)              /**< (I2SMCC_IMRB) Interrupt Mask Register B Offset */
#define I2SMCC_ISRB_REG_OFST           (0x2C)              /**< (I2SMCC_ISRB) Interrupt Status Register B Offset */
#define I2SMCC_RHR_REG_OFST            (0x30)              /**< (I2SMCC_RHR) Receiver Holding Register Offset */
#define I2SMCC_THR_REG_OFST            (0x34)              /**< (I2SMCC_THR) Transmitter Holding Register Offset */
#define I2SMCC_WPMR_REG_OFST           (0xE4)              /**< (I2SMCC_WPMR) Write Protection Mode Register Offset */
#define I2SMCC_WPSR_REG_OFST           (0xE8)              /**< (I2SMCC_WPSR) Write Protection Status Register Offset */
#define I2SMCC_VERSION_REG_OFST        (0xFC)              /**< (I2SMCC_VERSION) Version Register Offset */

